### import pandas as pd

In [2]:
names = ["Jane", "June", "Jenny", "Jacky", "Johnny", "Jack", "Jeremy"]
cars = ["Ford", "Fiat", "Ford", "Ford", "BMW", "Mercedes", "Honda"]
colors = ["black", "blue", "white", "white", "white", "white", "blue"]

In [3]:
df = pd.DataFrame(data = {"Names": names, "Cars": cars, "Colours": colors})
df = df[["Names", "Cars", "Colours"]]

In [4]:
df

    Names      Cars Colours
0    Jane      Ford   black
1    June      Fiat    blue
2   Jenny      Ford   white
3   Jacky      Ford   white
4  Johnny       BMW   white
5    Jack  Mercedes   white
6  Jeremy     Honda    blue

In [5]:
summary = df.groupby(by = ["Cars", "Colours"])["Names"].count()

In [11]:
summary

Cars      Colours
BMW       white      1
Fiat      blue       1
Ford      black      1
          white      2
Honda     blue       1
Mercedes  white      1
Name: Names, dtype: int64

In [13]:
summary.loc[[('BMW', 'white'), ('Ford', 'white')]]

Cars  Colours
BMW   white      1
Ford  white      2
Name: Names, dtype: int64

In [36]:
summary.reset_index(level=["Cars", "Colours"])

       Cars Colours  Names
0       BMW   white      1
1      Fiat    blue      1
2      Ford   black      1
3      Ford   white      2
4     Honda    blue      1
5  Mercedes   white      1